.config/doom/config.el

(setq user-full-name "Kirill K"
      user-mail-address "2spybot@gmail.com")

(setq confirm-kill-emacs nil)

;; Whether display icons in the mode-line.
;; While using the server mode in GUI, should set the value explicitly.
(setq doom-modeline-icon t)

;; Whether display the icon for `major-mode'. It respects option `doom-modeline-icon'.
(setq doom-modeline-major-mode-icon t)

;; Whether display the colorful icon for `major-mode'.
;; It respects `nerd-icons-color-icons'.
(setq doom-modeline-major-mode-color-icon t)

;; Whether display the icon for the buffer state. It respects option `doom-modeline-icon'.
(setq doom-modeline-buffer-state-icon t)

;; Whether display the modification icon for the buffer.
;; It respects option `doom-modeline-icon' and option `doom-modeline-buffer-state-icon'.
(setq doom-modeline-buffer-modification-icon t)

;; Whether display the lsp icon. It respects option `doom-modeline-icon'.
(setq doom-modeline-lsp-icon t)

(setq doom-modeline-enable-word-count t)

(setq doom-theme 'catppuccin)

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(add-to-list 'default-frame-alist '(alpha 93 83))

(let ((alternatives '(
                      "emacs.svg"
                      "doom-vapourwave.png"
                      "doomEmacsDracula.svg"
                      "logo-mini-doom.png"
                      )))
  (setq fancy-splash-image
        (concat doom-user-dir "images/"
                (nth (random (length alternatives)) alternatives))))

(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 15 :weight 'light)
      doom-variable-pitch-font (font-spec :family "Iosevka" :size 16)
      ;; doom-variable-pitch-font (font-spec :family "JetBrainsMono Nerd Font" :size 15)
      doom-big-font (font-spec :family "JetBrainsMono Nerd Font" :size 24))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq display-line-numbers-type 'relative)

(custom-set-faces! '(cursor :background "#F0A015"))

(custom-set-faces! '(org-list-dt :foreground "#F0A015"))

(custom-set-faces
  '(org-level-1 ((t (:inherit outline-1 :height 1.325))))
  '(org-level-2 ((t (:inherit outline-2 :height 1.125))))
  '(org-level-3 ((t (:inherit outline-3 :height 1.05 :foreground "#77D0E7"))))
  '(org-level-4 ((t (:inherit outline-4 :height 1.01))))
  '(org-level-5 ((t (:inherit outline-5 :height 1.01))))
  '(org-level-6 ((t (:inherit outline-6 :height 1.01))))
  '(org-level-7 ((t (:inherit outline-7 :height 1.01))))
  '(org-document-title ((t (:inherit outline-7 :bold t :height 1.625))))
)

(custom-set-faces!
