.config/doom/doomemacs.org
*** Org-Agenda Visuals
#+begin_src emacs-lisp
(custom-set-faces!
    '(org-agenda-date :inherit outline-1 :height 1.15)
    '(org-agenda-date-today :inherit outline-2 :height 1.15)
    '(org-agenda-date-weekend :inherit outline-1 :height 1.15)
    '(org-agenda-date-weekend-today :inherit outline-2 :height 1.15)
    '(org-super-agenda-header :inherit custom-button :weight bold :height 1.05)
    '(org-link :foreground unspecified))
#+end_src

** Key Binding
Replace the default =goto-line= keybindings with =avy-goto-line=, which is more flexible and also falls back to =goto-line= if a number is typed.
#+begin_src emacs-lisp
(map! "M-g g" #'avy-goto-line)
(map! "M-g M-g" #'avy-goto-line)
#+end_src

H - start of line
L - end of line
#+begin_src emacs-lisp
(map! :n "H" #'evil-first-non-blank)
(map! :n "L" #'evil-end-of-line)
#+end_src

Vterm Toggle
#+begin_src emacs-lisp
(map! :n "M-z" #'+vterm/toggle)
#+end_src

Buffers
#+begin_src emacs-lisp
(map! :n "M-q" #'kill-current-buffer)
(map! :n "M-n" #'next-buffer)
(map! :n "M-p" #'previous-buffer)
#+end_src

jj - Evil Esc
#+begin_src emacs-lisp
(after! evil-escape
  (setq evil-escape-key-sequence "jj"))
#+end_src

Org-Roam keybindings
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("n r" . "org-roam")
       :desc "Completion at point" "c" #'completion-at-point
       :desc "Find node"           "f" #'org-roam-node-find
       :desc "Show graph"          "g" #'org-roam-graph
       :desc "Insert node"         "i" #'org-roam-node-insert
       :desc "Capture to node"     "n" #'org-roam-capture
       :desc "Toggle roam buffer"  "r" #'org-roam-buffer-toggle))

(map! :n "C-f f" #'org-roam-node-find)
(map! :n "C-f r" #'org-roam-node-random)
(map! :n "C-f b" #'org-mark-ring-goto)
#+end_src


* Org mode

Here are some of the resources I have found useful in learning it:

- Howard Abrams' [[http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html][Introduction to Literate Programming]], which got me jumpstarted into writing code documented with org-mode.
- Nick Anderson's [[https://github.com/nickanderson/Level-up-your-notes-with-Org][Level up your notes with Org]], which contains many useful tips and configuration tricks. Nick's recommendation also got me to start looking into Org-mode in the first place!
- Sacha Chua's [[http://sachachua.com/blog/2014/01/tips-learning-org-mode-emacs/][Some tips for learning Org Mode for Emacs]], her [[http://pages.sachachua.com/.emacs.d/Sacha.html][Emacs configuration]] and many of her [[http://sachachua.com/blog/category/emacs/][other articles]].
- Rainer König's [[https://www.youtube.com/playlist?list=PLVtKhBrRV_ZkPnBtt_TD1Cs9PJlU0IIdE][OrgMode Tutorial]] video series.

Doom's Org module provides a lot of sane configuration settings, so I don't have to configure so much as in my [[https://github.com/zzamboni/dot-emacs/][previous hand-crafted config]].

** General Org Configuration

Default directory for Org files.
#+begin_src emacs-lisp
(setq org-directory "~/Documents/org/")
(setq org-default-notes-file "~/Documents/org/Agenda/Inbox.org")
#+end_src

Hide Org markup indicators.
#+begin_src emacs-lisp
(after! org (setq org-hide-emphasis-markers t))
#+end_src
** Org Visual Settings

*** Org-Modern
#+begin_src emacs-lisp
(after! org
    (setq org-ellipsis "…"
          org-modern-hide-stars nil
          org-modern-star 'replace
          org-modern-replace-stars "⁖◉✳○❂✸◇◈"))
#+end_src


** Capturing and note taking

*** General settings
First, I define where all my Org-captured things can be found.

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files '(
                           "~/Documents/org/Agenda/Personal.org"
                           "~/Documents/org/Agenda/Projects.org"
                           "~/Documents/org/Agenda/Work.org"
                           "~/Documents/org/Agenda/Inbox.org"
                           )))
#+end_src

I'm still trying out =org-roam=, although I have not figured out very well how it works for my setup.
#+begin_src emacs-lisp
(after! org
    (setq org-roam-directory "~/Documents/org/roam/"
        org-roam-db-location "~/Documents/org/roam/org-roam.db"
        org-roam-graph-viewer "floorp")
)
#+end_src

Configure attachments to be stored together with their Org document.
#+begin_src emacs-lisp
(after! org
    (setq org-attach-id-dir "~/Documents/org/.attach"
        org-id-locations-file "~/Documents/org/.orgids")
)
#+end_src
*** Org Capture Template
#+begin_src emacs-lisp
(after! org
    (setq org-capture-templates
    '(("t" "Todo" entry (file+headline "~/Documents/org/Agenda/Inbox.org" "Tasks")
            "* TODO %?\n  %i\n  %a")
        ("j" "Journal" entry (file+datetree "~/Documents/org/Agenda/Inbox.org")
            "* %?\nEntered on %U\n  %i\n  %a")))
)
#+end_src
*** OrgRoam Templates
#+begin_src emacs-lisp
(after! org
    (setq org-roam-capture-templates
            '(("d" "default" plain
                "%?"
                :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)

            ("b" "book" plain
                "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
                :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)

            ("n" "notes" plain (file "~/Documents/org/roam/Templates/NoteTemplate.org")
                :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)
        )
    )
)
#+end_src
*** Org-Tag-List
#+begin_src emacs-lisp
(after! org
    (setq org-tag-alist
        '(;;Places
            ("@home" . ?H)
            ("@work" . ?W)

            ;; Activities
            ("@health" . ?h)
            ("@investing" . ?i)
            ("@learning" . ?l)
            ("@youtube" . ?y)
            ("@planing" . ?n)
            ("@programming" . ?p)
            ("@writing" . ?w)
            ("@shopping" . ?s)
            ("@message" . ?m)
            ("@call" . ?a)))
)

#+end_src
*** OrgAgenda
#+begin_src emacs-lisp
(after! org
    (setq calendar-week-start-day 1)

    (setq org-agenda-skip-function-global '(org-agenda-skip-entry-if 'todo 'done))

    (setq org-agenda-span 1
            org-agenda-start-day "+0d")

    (setq org-agenda-custom-commands
        '(("p" "Planning"
                ((tags-todo "+@planning"
                                ((org-agenda-overriding-header "Planning Tasks")))
                (tags-todo "-{.*}"
                                ((org-agenda-overriding-header "Untagged Tasks")))
                (todo ".*" ((org-agenda-files '("~/Documents/org/Agenda/Inbox.org"))
                                (org-agenda-overriding-header "Unprocessed Inbox Items")))))

            ("d" "Daily Agenda"
                ((agenda "" ((org-agenda-span 'day)
                        (org-deadline-warning-days 7)))
                (tags-todo "+PRIORITY=\"A\""
                        ((org-agenda-overriding-header "High Priority Tasks")))))

            ("w" "Weekly Review"
                ((agenda ""
                        ((org-agenda-overriding-header "Completed Tasks")
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo 'done))
                        (org-agenda-span 'week)))

                (agenda ""
                        ((org-agenda-overriding-header "Unfinished Scheduled Tasks")
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-span 'week)))))))

)
#+end_src

** Other Org stuff
*** Olivetti
#+begin_src emacs-lisp
(setq olivetti-style 'fancy
      olivetti-margin-width 120)
(setq-default olivetti-body-width 120)

(defun org-agenda-open-hook ()
  (olivetti-mode))

(add-hook 'org-agenda-mode-hook 'org-agenda-open-hook)
(add-hook 'org-mode-hook 'org-agenda-open-hook)
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! olivetti)
#+end_src
*** AutoTangle

#+begin_src emacs-lisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle)
#+end_src
*** Org Roam QL
#+begin_src emacs-lisp :tangle packages.el
(package! org-roam-ql)
#+end_src
** Export
#+begin_src emacs-lisp
(after! org
    (setq org-use-property-inheritance t
          org-latex-hyperref-template "\\hypersetup{\n pdfauthor={%a},\n pdftitle={%t},\n colorlinks=true}\n"
          org-latex-pdf-process '("tectonic -X compile --outdir=%o -Z shell-escape -Z continue-on-errors %f"))

)
#+end_src

* Other tools
** Miscellaneous packages
*** Gptel
#+begin_src emacs-lisp :tangle packages.el
(package! gptel)
#+end_src
*** All-The-Icons
#+begin_src emacs-lisp :tangle packages.el
(package! all-the-icons-ibuffer)
(package! all-the-icons-dired)
(package! all-the-icons-completion)
#+end_src
*** Yadm Integration
#+begin_src emacs-lisp :tangle packages.el
(package! yadm.el
  :recipe (:host github :repo "seanfarley/yadm.el"))
#+end_src
