.config/doom/config.el
    '(org-agenda-date :inherit outline-1 :height 1.15)
    '(org-agenda-date-today :inherit outline-2 :height 1.15)
    '(org-agenda-date-weekend :inherit outline-1 :height 1.15)
    '(org-agenda-date-weekend-today :inherit outline-2 :height 1.15)
    '(org-super-agenda-header :inherit custom-button :weight bold :height 1.05)
    '(org-link :foreground unspecified))

(map! "M-g g" #'avy-goto-line)
(map! "M-g M-g" #'avy-goto-line)

(map! :n "H" #'evil-first-non-blank)
(map! :n "L" #'evil-end-of-line)

(map! :n "M-z" #'+vterm/toggle)

(map! :n "M-q" #'kill-current-buffer)
(map! :n "M-n" #'next-buffer)
(map! :n "M-p" #'previous-buffer)

(after! evil-escape
  (setq evil-escape-key-sequence "jj"))

(map! :leader
      (:prefix ("n r" . "org-roam")
       :desc "Completion at point" "c" #'completion-at-point
       :desc "Find node"           "f" #'org-roam-node-find
       :desc "Show graph"          "g" #'org-roam-graph
       :desc "Insert node"         "i" #'org-roam-node-insert
       :desc "Capture to node"     "n" #'org-roam-capture
       :desc "Toggle roam buffer"  "r" #'org-roam-buffer-toggle))

(map! :n "C-f f" #'org-roam-node-find)
(map! :n "C-f r" #'org-roam-node-random)
(map! :n "C-f b" #'org-mark-ring-goto)

(setq org-directory "~/Documents/org/")
(setq org-default-notes-file "~/Documents/org/Agenda/Inbox.org")

(after! org (setq org-hide-emphasis-markers t))

(after! org
    (setq org-ellipsis "…"
          org-modern-hide-stars nil
          org-modern-star 'replace
          org-modern-replace-stars "⁖◉✳○❂✸◇◈"))

(after! org
  (setq org-agenda-files '(
                           "~/Documents/org/Agenda/Personal.org"
                           "~/Documents/org/Agenda/Projects.org"
                           "~/Documents/org/Agenda/Work.org"
                           "~/Documents/org/Agenda/Inbox.org"
                           )))

(after! org
    (setq org-roam-directory "~/Documents/org/roam/"
        org-roam-db-location "~/Documents/org/roam/org-roam.db"
        org-roam-graph-viewer "floorp")
)

(after! org
    (setq org-attach-id-dir "~/Documents/org/.attach"
        org-id-locations-file "~/Documents/org/.orgids")
)

(after! org
    (setq org-capture-templates
    '(("t" "Todo" entry (file+headline "~/Documents/org/Agenda/Inbox.org" "Tasks")
            "* TODO %?\n  %i\n  %a")
        ("j" "Journal" entry (file+datetree "~/Documents/org/Agenda/Inbox.org")
            "* %?\nEntered on %U\n  %i\n  %a")))
)

(after! org
    (setq org-roam-capture-templates
            '(("d" "default" plain
                "%?"
                :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)

            ("b" "book" plain
                "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
                :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)

            ("n" "notes" plain (file "~/Documents/org/roam/Templates/NoteTemplate.org")
                :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)
        )
    )
)

(after! org
    (setq org-tag-alist
        '(;;Places
            ("@home" . ?H)
            ("@work" . ?W)

            ;; Activities
            ("@health" . ?h)
            ("@investing" . ?i)
            ("@learning" . ?l)
            ("@youtube" . ?y)
            ("@planing" . ?n)
            ("@programming" . ?p)
            ("@writing" . ?w)
            ("@shopping" . ?s)
            ("@message" . ?m)
            ("@call" . ?a)))
)

(after! org
    (setq calendar-week-start-day 1)

    (setq org-agenda-skip-function-global '(org-agenda-skip-entry-if 'todo 'done))

    (setq org-agenda-span 1
            org-agenda-start-day "+0d")

    (setq org-agenda-custom-commands
        '(("p" "Planning"
                ((tags-todo "+@planning"
                                ((org-agenda-overriding-header "Planning Tasks")))
                (tags-todo "-{.*}"
                                ((org-agenda-overriding-header "Untagged Tasks")))
                (todo ".*" ((org-agenda-files '("~/Documents/org/Agenda/Inbox.org"))
                                (org-agenda-overriding-header "Unprocessed Inbox Items")))))

            ("d" "Daily Agenda"
                ((agenda "" ((org-agenda-span 'day)
                        (org-deadline-warning-days 7)))
                (tags-todo "+PRIORITY=\"A\""
                        ((org-agenda-overriding-header "High Priority Tasks")))))

            ("w" "Weekly Review"
                ((agenda ""
                        ((org-agenda-overriding-header "Completed Tasks")
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo 'done))
                        (org-agenda-span 'week)))

                (agenda ""
                        ((org-agenda-overriding-header "Unfinished Scheduled Tasks")
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-span 'week)))))))

)

(setq olivetti-style 'fancy
      olivetti-margin-width 120)
(setq-default olivetti-body-width 120)

(defun org-agenda-open-hook ()
  (olivetti-mode))

(add-hook 'org-agenda-mode-hook 'org-agenda-open-hook)
(add-hook 'org-mode-hook 'org-agenda-open-hook)

(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

(after! org
    (setq org-use-property-inheritance t
          org-latex-hyperref-template "\\hypersetup{\n pdfauthor={%a},\n pdftitle={%t},\n colorlinks=true}\n"
          org-latex-pdf-process '("tectonic -X compile --outdir=%o -Z shell-escape -Z continue-on-errors %f"))

)
